# # # # # # # # # # # # # # # # # # # # # # # # # # # import os

# # # # # # # # # # # # # # # # # # # # # # # # # # # output_dir = r"D:\code\projects\fighter_object_tracking\src\models"
# # # # # # # # # # # # # # # # # # # # # # # # # # # output_images_dir = os.path.join(output_dir, 'model')
# # # # # # # # # # # # # # # # # # # # # # # # # # # os.makedirs(output_images_dir, exist_ok = True) 


# # # # # # # # # # # # # # # # # # # # # # # # # # import os

# # # # # # # # # # # # # # # # # # # # # # # # # # parent = 'tmp_example'
# # # # # # # # # # # # # # # # # # # # # # # # # # file_path = os.path.join(parent, 'images')  # sẽ tạo 1 file với tên 'images'

# # # # # # # # # # # # # # # # # # # # # # # # # # # tạo thư mục cha
# # # # # # # # # # # # # # # # # # # # # # # # # # os.makedirs(parent, exist_ok=True)

# # # # # # # # # # # # # # # # # # # # # # # # # # # tạo một file nơi ta sẽ mong đợi là thư mục
# # # # # # # # # # # # # # # # # # # # # # # # # # with open(file_path, 'w') as f:
# # # # # # # # # # # # # # # # # # # # # # # # # #     f.write('tôi là file, không phải thư mục')

# # # # # # # # # # # # # # # # # # # # # # # # # # # # bây giờ gọi makedirs trên cùng đường dẫn -> sẽ raise FileExistsError
# # # # # # # # # # # # # # # # # # # # # # # # # # # os.makedirs(file_path, exist_ok=True)



# # # # # # # # # # # # # # # # # # # # # # # # # x = 'hello'
# # # # # # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # # # # # print(s)



# # # # # # # # # # # # # # # # # # # # # # # # x = 'hello'
# # # # # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # # # # print(s)

# # # # # # # # # # # # # # # # # # # # # # # x = 'hello'
# # # # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # # # print(x,s)

# # # # # # # # # # # # # # # # # # # # # # x = 'hello'
# # # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # # print(x , s)

# # # # # # # # # # # # # # # # # # # # # # x = 'live'
# # # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # # print(x, s)



# # # # # # # # # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # # print(s, x)

# # # # # # # # # # # # # # # # # # # # x ='evil'
# # # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # # print(s, x)


# # # # # # # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # # print(s, x)






# # # # # # # # # # # # # # # # # # x= 'evil'
# # # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # # print(s,x)




# # # # # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # # print(s,x)



# # # # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # # # print()


# # # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # # s= x[::-1 ]
# # # # # # # # # # # # # # # print(s,x)


# # # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # # print(s,x)


# # # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # # print(s,x)

# # # # # # # # # # # # x = 'evil'
# # # # # # # # # # # # s = x[::-1]
# # # # # # # # # # # # print(s,x)

# # # # # # # # # # # x = 'evil'

# # # # # # # # # # x = 'evil'
# # # # # # # # # # s = x[::-1 ]
# # # # # # # # # # print(s,x)



# # # # # # # # # x = 'evil'
# # # # # # # # # s =x[::-1]
# # # # # # # # # print(s,x)



# # # # # # # # x = 'evil'
# # # # # # # # s =x[::-1]
# # # # # # # # print(s,x)







# # # # # # # x = 'evil'
# # # # # # # s = x[::-1]
# # # # # # # print(s,x)



# # # # # # x = 'evil'
# # # # # # s = x[::-1]
# # # # # # print(s,x)


# # # # # x = 'evil'
# # # # # s = x


# # # # x = 'evil'
# # # # s = x[::-1]
# # # # print(s,x)

# # # x = 'evil'
# # # s = x[::-1]
# # # print(s,x)

# # x = 'evil'
# # s = x[::-1]
# # print(x, s)


# x = 'evil'
# s = x[::-1]
# print(x,s)